INSERT INTO memo(title,content,create_time)
VALUES('JPAでテーブルの自動生成を無効','spring.jpa.hibernate.ddl-autoプロパティを設定します。
このプロパティは、テーブルの自動生成に関する設定を行います。
テーブルの自動生成を無効にするには、このプロパティの値をnoneに設定します。','2024-04-04 04:00:00.000'),
('ddl-autoのプロパティの値','create: アプリケーション起動時にテーブルを作成します。既存のテーブルがある場合は、それを削除してから再作成します。
update: アプリケーション起動時にテーブルを更新します。新しいカラムを追加したり、既存のカラムを変更したりしますが、データの保持はします。
create-drop: アプリケーション起動時にテーブルを作成します。アプリケーション終了時にテーブルを削除します。
none: 自動的なテーブルの作成や更新は行いません。手動でデータベースのスキーマを管理する必要があります。','2024-04-04 05:00:00.000'),
('テスト1','テスト','2024-04-04 05:00:00.001'),
('テスト2','テスト','2024-04-04 05:00:00.002'),
('テスト3','テスト','2024-04-04 05:00:00.003'),
('テスト4','テスト','2024-04-04 05:00:00.004'),
('テスト5','テスト','2024-04-04 05:00:00.005'),
('テスト6','テスト','2024-04-04 05:00:00.006'),
('テスト7','テスト','2024-04-04 05:00:00.007'),
('テスト8','テスト','2024-04-04 05:00:00.008');